# Load modules

In [1]:
import numpy as np
import pandas as pd

# DataFrame作成

row: 行.  
column: 列.カラム名=列名.

## 作り方1

pd.DataFrame(リスト, columns=リスト)

In [2]:
df0 = pd.DataFrame([['太郎', 160, 50, 20], ['次郎', 170,60,26], ['三郎', 180, 70, 30], ['四郎', 190, 80, 10]], columns=['名前', '身長', '体重', '年齢'])
df0

   名前   身長  体重  年齢
0  太郎  160  50  20
1  次郎  170  60  26
2  三郎  180  70  30
3  四郎  190  80  10

## 作り方2

pd.DataFrame(辞書)

In [3]:
df1 = pd.DataFrame({'名前': ['太郎', '次郎', '三郎', '四郎'], '身長': [160, 170, 180, 190], '体重': [50, 60, 70, 80], '年齢': [20, 26, 30, 10]})
df1

   名前   身長  体重  年齢
0  太郎  160  50  20
1  次郎  170  60  26
2  三郎  180  70  30
3  四郎  190  80  10

## 比較してみる

In [4]:
df0 == df1

     名前    身長    体重    年齢
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

# Analysis

## カラムの指定

In [5]:
df0[['名前', '年齢']]

   名前  年齢
0  太郎  20
1  次郎  26
2  三郎  30
3  四郎  10

## 行の追加

In [6]:
df0.loc[4] = ['五郎', 200, 50, 5]
df0

   名前   身長  体重  年齢
0  太郎  160  50  20
1  次郎  170  60  26
2  三郎  180  70  30
3  四郎  190  80  10
4  五郎  200  50   5

In [7]:
df0.shape

(5, 4)

## 列の追加

### 行ごとに値が違う場合

In [8]:
df0['住所'] = ['島根', '島根', '東京', '島根', '島根']
df0

   名前   身長  体重  年齢  住所
0  太郎  160  50  20  島根
1  次郎  170  60  26  島根
2  三郎  180  70  30  東京
3  四郎  190  80  10  島根
4  五郎  200  50   5  島根

In [9]:
df0.shape

(5, 5)

### 全ての行で値が同じ場合

In [10]:
df0['性別'] = '男'
df0

   名前   身長  体重  年齢  住所 性別
0  太郎  160  50  20  島根  男
1  次郎  170  60  26  島根  男
2  三郎  180  70  30  東京  男
3  四郎  190  80  10  島根  男
4  五郎  200  50   5  島根  男

In [11]:
df0.shape

(5, 6)

## 条件を満たす行のみを抽出

In [12]:
df2 = df0[df0['住所']=='島根']
df2

   名前   身長  体重  年齢  住所 性別
0  太郎  160  50  20  島根  男
1  次郎  170  60  26  島根  男
3  四郎  190  80  10  島根  男
4  五郎  200  50   5  島根  男

In [13]:
df2.shape

(4, 6)

## 2つの列から計算して新たな列を追加

In [14]:
df0

   名前   身長  体重  年齢  住所 性別
0  太郎  160  50  20  島根  男
1  次郎  170  60  26  島根  男
2  三郎  180  70  30  東京  男
3  四郎  190  80  10  島根  男
4  五郎  200  50   5  島根  男

### BMIを追加

\[
    BMI = \frac{w}{h^2}
\nonumber
\]

In [15]:
df0['BMI'] = df0.apply(lambda row: row['体重'] / ((row['身長']/100)**2), axis=1)
df0

   名前   身長  体重  年齢  住所 性別        BMI
0  太郎  160  50  20  島根  男  19.531250
1  次郎  170  60  26  島根  男  20.761246
2  三郎  180  70  30  東京  男  21.604938
3  四郎  190  80  10  島根  男  22.160665
4  五郎  200  50   5  島根  男  12.500000

### lambda関数

In [16]:
# xを渡すと2x+1を返す関数
f = (lambda x: 2*x+1)
f

In [17]:
f(5)

11